Workspace/test_cases/vertificating/lowMachChannel/0_org/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    emptyPlanes
    {
        type            empty;
    }
    "(.*Wall)"
    {
        type            zeroGradient;
    }
    inlet
    {
        type totalPressure;
        rho             none;
        psi             thermo:psi;
        gamma           1.4;
        p0              uniform 1e5;
        value           uniform 0.8e5;
    }

    outlet
    {
        type fixedValue;
        value		uniform 0.9930313848742520e5;
    }
}

// ************************************************************************* //
